Ran Plan for dir: `Aws Vpn` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_customer_gateway.conor-customer-gateway will be created
+ resource "aws_customer_gateway" "conor-customer-gateway" {
+       arn        = (known after apply)
+       bgp_asn    = "65000"
+       id         = (known after apply)
+       ip_address = "208.67.222.222"
+       tags       = {
+           "Name" = "conor-customer-gateway"
        }
+       tags_all   = {
+           "Name" = "conor-customer-gateway"
        }
+       type       = "ipsec.1"
    }

  # aws_instance.conor-instance will be created
+ resource "aws_instance" "conor-instance" {
+       ami                                  = "ami-04e49d62cf88738f1"
+       arn                                  = (known after apply)
+       associate_public_ip_address          = (known after apply)
+       availability_zone                    = (known after apply)
+       cpu_core_count                       = (known after apply)
+       cpu_threads_per_core                 = (known after apply)
+       disable_api_termination              = (known after apply)
+       ebs_optimized                        = (known after apply)
+       get_password_data                    = false
+       host_id                              = (known after apply)
+       id                                   = (known after apply)
+       instance_initiated_shutdown_behavior = (known after apply)
+       instance_state                       = (known after apply)
+       instance_type                        = "t2.micro"
+       ipv6_address_count                   = (known after apply)
+       ipv6_addresses                       = (known after apply)
+       key_name                             = (known after apply)
+       monitoring                           = (known after apply)
+       outpost_arn                          = (known after apply)
+       password_data                        = (known after apply)
+       placement_group                      = (known after apply)
+       placement_partition_number           = (known after apply)
+       primary_network_interface_id         = (known after apply)
+       private_dns                          = (known after apply)
+       private_ip                           = (known after apply)
+       public_dns                           = (known after apply)
+       public_ip                            = (known after apply)
+       secondary_private_ips                = (known after apply)
+       security_groups                      = (known after apply)
+       source_dest_check                    = true
+       subnet_id                            = (known after apply)
+       tags                                 = {
+           "Name" = "conor-VPN-test-instance"
        }
+       tags_all                             = {
+           "Name" = "conor-VPN-test-instance"
        }
+       tenancy                              = (known after apply)
+       user_data                            = (known after apply)
+       user_data_base64                     = (known after apply)
+       vpc_security_group_ids               = (known after apply)

+       capacity_reservation_specification (known after apply)

+       ebs_block_device (known after apply)

+       enclave_options (known after apply)

+       ephemeral_block_device (known after apply)

+       metadata_options (known after apply)

+       network_interface (known after apply)

+       root_block_device (known after apply)
    }

  # aws_internet_gateway.conor-internet-gateway will be created
+ resource "aws_internet_gateway" "conor-internet-gateway" {
+       arn      = (known after apply)
+       id       = (known after apply)
+       owner_id = (known after apply)
+       tags     = {
+           "Name" = "example-igw"
        }
+       tags_all = {
+           "Name" = "example-igw"
        }
+       vpc_id   = (known after apply)
    }

  # aws_route.vpn_route will be created
+ resource "aws_route" "vpn_route" {
+       gateway_id             = (known after apply)
+       id                     = (known after apply)
+       instance_id            = (known after apply)
+       instance_owner_id      = (known after apply)
+       network_interface_id   = (known after apply)
+       origin                 = (known after apply)
+       route_table_id         = (known after apply)
+       state                  = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_route_table.conor-route-table will be created
+ resource "aws_route_table" "conor-route-table" {
+       arn              = (known after apply)
+       id               = (known after apply)
+       owner_id         = (known after apply)
+       propagating_vgws = (known after apply)
+       route            = [
+           {
+               cidr_block                 = "0.0.0.0/0"
+               gateway_id                 = (known after apply)
                # (11 unchanged attributes hidden)
            },
        ]
+       tags             = {
+           "Name" = "example-route-table"
        }
+       tags_all         = {
+           "Name" = "example-route-table"
        }
+       vpc_id           = (known after apply)
    }

  # aws_route_table_association.conor-route-table-association will be created
+ resource "aws_route_table_association" "conor-route-table-association" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # aws_security_group.conor-security-group will be created
+ resource "aws_security_group" "conor-security-group" {
+       arn                    = (known after apply)
+       description            = "Managed by Terraform"
+       egress                 = [
+           {
+               cidr_blocks      = [
+                   "10.0.40.86/32",
                ]
+               from_port        = 0
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "-1"
+               security_groups  = []
+               self             = false
+               to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
+       id                     = (known after apply)
+       ingress                = [
+           {
+               cidr_blocks      = [
+                   "10.0.40.86/32",
                ]
+               from_port        = 22
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = []
+               self             = false
+               to_port          = 22
                # (1 unchanged attribute hidden)
            },
        ]
+       name                   = (known after apply)
+       name_prefix            = (known after apply)
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags                   = {
+           "Name" = "conor-security-group"
        }
+       tags_all               = {
+           "Name" = "conor-security-group"
        }
+       vpc_id                 = (known after apply)
    }

  # aws_subnet.conor-subnet will be created
+ resource "aws_subnet" "conor-subnet" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "eu-west-1a"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.1.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name" = "example-subnet"
        }
+       tags_all                                       = {
+           "Name" = "example-subnet"
        }
+       vpc_id                                         = (known after apply)
    }

  # aws_vpc.conor-VPC will be created
+ resource "aws_vpc" "conor-VPC" {
+       arn                                  = (known after apply)
+       cidr_block                           = "10.0.0.0/16"
+       default_network_acl_id               = (known after apply)
+       default_route_table_id               = (known after apply)
+       default_security_group_id            = (known after apply)
+       dhcp_options_id                      = (known after apply)
+       enable_classiclink                   = (known after apply)
+       enable_classiclink_dns_support       = (known after apply)
+       enable_dns_hostnames                 = (known after apply)
+       enable_dns_support                   = true
+       id                                   = (known after apply)
+       instance_tenancy                     = "default"
+       ipv6_association_id                  = (known after apply)
+       ipv6_cidr_block                      = (known after apply)
+       ipv6_cidr_block_network_border_group = (known after apply)
+       main_route_table_id                  = (known after apply)
+       owner_id                             = (known after apply)
+       tags                                 = {
+           "Name" = "example-vpc"
        }
+       tags_all                             = {
+           "Name" = "example-vpc"
        }
    }

  # aws_vpn_connection.conor-vpn-connection will be created
+ resource "aws_vpn_connection" "conor-vpn-connection" {
+       arn                            = (known after apply)
+       customer_gateway_configuration = (known after apply)
+       customer_gateway_id            = (known after apply)
+       enable_acceleration            = (known after apply)
+       id                             = (known after apply)
+       local_ipv4_network_cidr        = (known after apply)
+       local_ipv6_network_cidr        = (known after apply)
+       remote_ipv4_network_cidr       = (known after apply)
+       remote_ipv6_network_cidr       = (known after apply)
+       routes                         = (known after apply)
+       static_routes_only             = true
+       tags                           = {
+           "Name" = "conor-vpn-connection"
        }
+       tags_all                       = {
+           "Name" = "conor-vpn-connection"
        }
+       transit_gateway_attachment_id  = (known after apply)
+       tunnel1_address                = (known after apply)
+       tunnel1_bgp_asn                = (known after apply)
+       tunnel1_bgp_holdtime           = (known after apply)
+       tunnel1_cgw_inside_address     = (known after apply)
+       tunnel1_inside_cidr            = (known after apply)
+       tunnel1_inside_ipv6_cidr       = (known after apply)
+       tunnel1_preshared_key          = (sensitive value)
+       tunnel1_vgw_inside_address     = (known after apply)
+       tunnel2_address                = (known after apply)
+       tunnel2_bgp_asn                = (known after apply)
+       tunnel2_bgp_holdtime           = (known after apply)
+       tunnel2_cgw_inside_address     = (known after apply)
+       tunnel2_inside_cidr            = (known after apply)
+       tunnel2_inside_ipv6_cidr       = (known after apply)
+       tunnel2_preshared_key          = (sensitive value)
+       tunnel2_vgw_inside_address     = (known after apply)
+       tunnel_inside_ip_version       = (known after apply)
+       type                           = "ipsec.1"
+       vgw_telemetry                  = (known after apply)
+       vpn_gateway_id                 = (known after apply)
    }

  # aws_vpn_connection_route.conor-vpn-route will be created
+ resource "aws_vpn_connection_route" "conor-vpn-route" {
+       destination_cidr_block = "10.0.40.86/32"
+       id                     = (known after apply)
+       vpn_connection_id      = (known after apply)
    }

  # aws_vpn_gateway.conor-vpn-gateway will be created
+ resource "aws_vpn_gateway" "conor-vpn-gateway" {
+       amazon_side_asn = (known after apply)
+       arn             = (known after apply)
+       id              = (known after apply)
+       tags            = {
+           "Name" = "conor-vpn-gateway"
        }
+       tags_all        = {
+           "Name" = "conor-vpn-gateway"
        }
+       vpc_id          = (known after apply)
    }

  # aws_vpn_gateway_attachment.conor-vpn-gateway-attachment will be created
+ resource "aws_vpn_gateway_attachment" "conor-vpn-gateway-attachment" {
+       id             = (known after apply)
+       vpc_id         = (known after apply)
+       vpn_gateway_id = (known after apply)
    }

Plan: 13 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ instance_public_ip = (known after apply)
+ subnet_id          = (known after apply)
+ vpc_id             = (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d "Aws Vpn"
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://ex-github-complete.zinkworks.link/lock?id=CuBot137%252FTerraform%252FAws%2BVpn%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d "Aws Vpn"
  ```
Plan: 13 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```